Repository: QuantumPhysique/trale
Catalog: app/lib/l10n/app_*.arb
Languages: et, zh

source: Achievements
et: Saavutused
zh: 统计数据

source: days
et: päeva
zh: 天

source: weeks
et: nädalat
zh: 周

source: months
et: kuud
zh: 个月

source: month
et: kuu
zh: 月

source: years
et: aastat
zh: 年

source: year
et: aasta
zh: 年

# backupReminderButton
source: back up
et: varunda nüüd
zh: 备份

# backupSuccess
source: Backup successfully exported
et: Varukoopia tegemine õnnestus
zh: 备份已成功导出

source: weekly
et: kord nädalas
zh: 每周备份

source: monthly
et: kord kuus
zh: 每月备份

source: quarterly
et: kord kvartalis
zh: 每季度备份

# backupInterval
source: Interval
et: Sagedus
zh: 自动备份

source: last backup
et: viimane varukoopia
zh: 上次备份时间

source: next backup
et: järgmine varukoopia
zh: 下次备份时间

source: Date
et: Kuupäev
zh: 日期

source: Weight
et: Kaal
zh: 重量

# user
source: User profile
et: Kasutajaprofiil
zh: 用户资料

source: User settings
et: Kasutaja seadistused
zh: 用户设置

source: Theme
et: Kujundus
zh: 主题

source: Settings
et: Seadistused
zh: 设置

source: FAQ
et: KKK
zh: 常见问题

source: About
et: Rakenduse teave
zh: 关于

# darkmode
source: Dark
et: Tume kujundus
zh: 暗色模式

# lightmode
source: Light
et: Hele kujundus
zh: 亮色模式

# systemmode
source: System
et: Süsteemikohane
zh: 跟随系统

# export
source: Export all measurements
et: Ekspordi kõik andmed
zh: 备份数据

# exportSubtitle
source: This exposes all measurements to all apps.
et: Sellega on sinu andmed näha kõikidele rakendustele.
zh: 导出所有测量数据。

source: Open
et: Ava
zh: 打开

source: Abort
et: Katkesta
zh: 取消

# import
source: Import backup
et: Impordi varukoopia
zh: 恢复数据

# importSubtitle
source: Import measurements from .txt backup file.
et: Impordi andmed .txt-failina salvestatud varukoopiast või .csv-failist.
zh: 从 .txt 备份文件中导入测量数据。

# amoled
source: Black
et: Süsimust kujundus
zh: 纯黑模式

# amoledSubtitle
source: Change background color to true black for dark mode.
et: Tumeda kujunduse puhul kasuta õiget süsimusta värvi.
zh: 暗色主题使用纯黑色背景。

source: Factory reset
et: Taasta rakenduse algseis
zh: 重置应用

source: Delete
et: Kustuta
zh: 删除

source: Home
et: Avaleht
zh: 主页

source: Backup
et: Varunda
zh: 备份

source: Time
et: Aeg
zh: 时间

source: assets
et: vahendid
zh: 资产项

source: Version
et: Versioon
zh: 版本号

# tpl
source: Third-party licenses
et: Kolmandate osapoolte litsentsid
zh: 第三方许可证

# licence
source: License
et: Litsents
zh: 许可证

source: Open issue
et: Alusta veateate koostamist
zh: 提出问题(提交 issue)

# undertpl
source: © {years} by {author} under {licence} licence
et: © {years} {author}, avaldatud {licence} litsentsi alusel
zh: © {years} 年由 {author} 基于 {licence} 协议许可

# addWeight
source: Enter your weight
et: Sisesta oma kaal
zh: 输入您的体重

source: interpolation
et: interpolatsioon
zh: 插值(体重推算)

source: None
et: Määratlemata
zh: 无

source: Soft
et: Pehme
zh: 弱

source: Medium
et: Keskmine
zh: 中

source: packages
et: paketid
zh: 代码库

source: Loading
et: Laadime
zh: 加载中

source: Measurements
et: Salvestatud kaalud
zh: 测量数据

source: Welcome
et: Tere tulemast
zh: 欢迎

# onBoarding2
source: Choose one out of six themes to personalize your app. Which one does express your feelings the best?
et: Rakenduse isiklikustamiseks vali ühe kuuest valmiskujundusest. Missugune neist vastab kõige paremini sinu tunnetele ja meeleolule?
zh: 从六个主题中挑选一个，个性化您的应用程序。哪一个最能表达您的感受？

# onBoarding2Title
source: Style
et: Välimus
zh: 风格

# onBoarding3Title
source: Privacy
et: Privaatsus
zh: 隐私

source: Skip
et: Jäta vahele
zh: 跳过

# startApp
source: Start
et: Alusta
zh: 开始

source: Target weight
et: Kaalueesmärk
zh: 目标体重

# addUserName
source: How shall we call you?
et: Mis nime soovid kasutada?
zh: 我们该如何称呼您？

source: Add target weight
et: Lisa kaalueesmärk
zh: 填写目标体重

# intro2
source: to get started
et: alustamiseks
zh: 开始记录

# faq_q1
source: The feature/function X is missing. When will it be implemented?
et: Funktsionaalsus X on puudu. Millal te selle lisate?
zh: 软件缺少某项功能，它什么时候能被实现？

# faq_a2
source: Yes for sure! Just press the icon below.
et: Jah palun! Klõpsi ikooni siin all.
zh: 当然可以！只需点击下面这个按钮。

# faq_a2_widget
source: Return to onboarding screen
et: Tagasi sissejuhatusse
zh: 返回起始页

# faq_q3
source: What is the app icon showing?
et: Mis paistab rakenduse ikoonil?
zh: 应用程序图标显示的是什么？

source: min
et: väikseim
zh: 最小

source: total change
et: muutus kokku
zh: 总变化

source: mean
et: keskmine
zh: 平均值

# targetWeightReached
source: you reached your target weight!
et: sa oled saavutanud kaalueesmärgi!
zh: 您达到了目标体重！

# targetWeightReachedIn
source: left to reach target weight
et: on jäänud kaalueesmärgi saavutamiseni
zh: 距离目标体重

# maxStreak
source: longest streak
et: pikim andmejada
zh: 最长连续记录

source: current streak
et: praegune andmejada
zh: 当前连续记录

source: time since first measurement
et: aeg esimesest mõõtmisest
zh: 自首次测量已过

# backupReminder
source: Please back up regularly
et: Palun tee sagedasti varukoopiaid
zh: 请记得定期备份你的数据

# defaultLang
source: System default
et: Süsteemi keel
zh: 系统默认

source: Language
et: Keel
zh: 语言

# exportDialog
source: This will export all measurements to the external storage. Writing permissions are needed.
et: Järgnevaga ekspordime kõik kaaluandmed seadme andmeruumi. Selleks on vajalikud kirjutusõigused.
zh: 这将把所有测量数据导出到外部存储设备，此操作需要存储权限。

# reset
source: Reset app
et: Lähtesta rakendus
zh: 重置应用

# factoryResetSubtitle
source: Reset all settings and delete all measurements.
et: Sellega lähtestad kõik seadistused ja kustutad ka kõik salvestatud kaaluandmed.
zh: 重置所有选项并清除全部测量数据。

# factoryResetDialog
source: Reset application to default? This will delete all settings, and added measurements. This can not be undone.
et: Kas sa soovid rakenduse lähtestada? Sellega kõik seadistused muutuvad algväärtusteks ja kustutad kõik salvestatud kaaluandmed. Tegevust hiljem tagasi pöörata ei saa.
zh: 要将应用重置吗？这将删除所有设置，以及所有测量数据。注意，该操作无法撤销。

# importingAbort
source: Import aborted.
et: Import on katkestatud.
zh: 已取消导入。

source: OK
et: Sobib
zh: 确定

# importDialog
source: Include all measurements to the current database. This can not be undone!
et: Sellega kaasad kõik kaalumõõdistused praegusesse andmebaasi. Tegevust ei saa hiljem tagasi pöörata!
zh: 导入所有测量数据。此操作无法撤销！

source: Save
et: Salvesta
zh: 保存

source: Yes
et: Jah
zh: 确定

source: Edit
et: Muuda
zh: 编辑

source: Source code
et: Lähtekood
zh: 源代码

source: Strong
et: Tugev
zh: 强

# onBoarding1
source: This simplistic Material-You-design app helps you to reach your dream weight! Whether you want to gain weight, lose weight or simply maintain your weight: Reliable weight predictions and versatile statistics help you to stay on track. Join our community today to trace yourself. 🐺🤸‍♀️🏋‍♀️🧘‍♂️🏆🥇
et: See lihtne Material-You kujunduskeelel põhinev rakendus aitab sul jõuda sellise kaaluni, nagu tahaksid! Pole vahet, kas soovid kaalu lisada, kaotada või püsida samas kaalus: usaldusväärne kaaluennustus ja mitmekülgne statistika aitavad sul püsida õigel kursil. Liitu meie kogukonnaga ja pea arvet oma kaalu üle. 🐺🤸‍♀️🏋‍♀️🧘‍♂️🏆🥇
zh: 这款简约 、基于 Material-You 设计的应用程序将帮助您达到理想体重！无论您是想增重、减肥还是仅仅想保持体重： 可靠的体重预测与多样的统计分析有助于您持续掌握体重状况 现在就加入我们的社区，监测自己的体重变化 🐺🤸‍♀️🏋‍♀️🧘‍♂️🏆🥇

# onBoarding3
source: Thank you for giving our app a try. 🙂 If you like the app, we would be very happy about your feedback, a contribution on Github or a coffee. In return, we spare you annoying and privacy-critical ads.
et: Tänud, et proovid meie rakendust. 🙂 Kui see rakendus sulle meeldib, siis hea meelega kuuleksime sinu arvamust, näeksime kaastööd GitHubis või naudiksime sinu ostetud kohvi. Vastutasuks jäävad meie poolt ära tüütud ja privaatsusele kahjulikud reklaamid.
zh: 感谢您试用我们的应用程序🙂 如果您喜欢这个应用，我们将非常期待收到您的反馈。欢迎您在 Github 上做出贡献或请我们喝杯咖啡。作为回报，我们将为您屏蔽烦人的、涉及隐私的广告。

# targetWeightShort
source: Target
et: Eesmärk
zh: 目标

# targetWeightMotivation
source: Setting a target weight is very important and a step in the right direction. Having a goal in mind motivates you to do more to achieve it.
et: Kaalueesmärgi lisamine on väga oluline ja on sammuke õiges suunas. Kui sul eesmärk on teada, siis on sul lihtsam astuda järgmisi samme selle saavutamiseks.
zh: 设定目标体重非常重要，是朝着正确方向迈出的一步。有了目标，就会激励自己为实现目标做出更多努力。

# intro1
source: Press
et: Vajuta
zh: 点击

source: never
et: mitte kunagi
zh: 不自动备份

# stats
source: Statistics
et: Statistika
zh: 统计

source: week
et: nädal
zh: 周

source: biweekly
et: kaks korda nädalas
zh: 每两周备份

source: Danger zone
et: Ohutsoon
zh: 风险选项

# unit
source: Units
et: Ühikud
zh: 数据单位

# faqtext
source: Here you find answers to some of the most frequent questions. If you have any other questions, feel free to open an issue on the github repository.
et: Järgnevas on vastused meilt tihti küsitule. Lisaküsimuste puhul palun ava teade meie GitHubi koodivaramus.
zh: 在这里，您可以找到一些常见问题的答案。如果您有任何其他问题，请随时在 Github 中提交 issue 并参与讨论。

# intro3
source: Today is a good day to start with your first measurement!
et: Täna on hea päev kaalulogi pidamisega alustamiseks!
zh: 今天是个好日子，开始您的第一次测量吧！

# faq_q2
source: Can I see once again the intro/onboarding screen?
et: Kuidas saan uuesti näha esimese kasutuskorra sissejuhatavat vaadet?
zh: 我能再看一遍应用介绍/起始页吗？

# faq_a1
source: The app is maintained in our free time and we try to keep the app sleek and simple. We believe that adding too many features making the app less usable. If you believe that we are missing a key feature, feel free to open an issue or a merge request.
et: Me arendame ja haldame rakendust oma vabast ajast ning proovime seda hoida napi ja lihtsana. Usume, et liiga paljude võimaluste lisamine teeks rakenduse kehvemini kasutatavaks. Aga kui arvad, et midagi väga olulist on puudu, siis palun koosta vastav kirjeldus või konkreetne päring uue koodi lisamiseks.
zh: 我们利用业余时间维护这个应用程序，并努力使其保持流畅和简洁。我们认为添加过多的功能会降低它的易用性。如果您认为我们缺少某个关键功能，请随时提出问题或合并请求。

# faq_a3
source: A howling wolf sitting, its tail partially hidden by the letter 't', and the letter 'r'.
et: Seal on üks ulguv hunt, mille saba varjavad osaliselt „t“ ja „r“ tähed.
zh: 一只坐着嚎叫的狼，它的尾巴被字母 "t "和字母 "r "遮住了一部分。

# target_weight_warning
source: Anorexia is a serious disease that is increasingly becoming a problem for society as a whole, partly due to the many negative examples on social media. To support prevention efforts, we do not allow target weights below 50 kg / 110 lb / 7.9 st and BMIs below 18.5.
et: Anoreksia on tõsine haigus, mis on meie ühiskondades levinud ja märgatavaks probleemiks. Osaliselt on selles süüdi sotsiaalmeedia, kust võib leida palju negatiivseid näiteid. Toetamaks ennetustegevust me ei võimalda sisestada kaalueesmärki alla 50 kg (110 lb / 7.9 st) või pikkuse ja kaalu kombinatsiooni, millest johtuv kehamassiindeks on alla 18,5.
zh: 厌食症是一种严重疾病，已逐渐成为社会面临的问题，部分原因是社交媒体上出现了过多负面事例。作为我们对预防厌食症的努力之一，我们不允许设置低于 50kg 目标体重。

source: change
et: muutus
zh: 变化

source: max
et: suurim
zh: 最大

source: measurement frequency
et: kaalumise sagedus
zh: 测量频率

source: strength
et: tugevus
zh: 插值强度

source: First day
et: Nädala algus
zh: 一周的第一天

source: experimental features
et: katselised funktsionaalsused
zh: 实验功能

# looseWeight
source: Lose weight
et: Kaota kaalu
zh: 减肥模式

# looseWeightSubtitle
source: Switching between losing or gaining weight.
et: Vaheta vaadet kaalukaotuse ja lisamise vahel.
zh: 在减肥模式和增重模式之间切换。

source: Gain weight
et: Lisa kaalu
zh: 增重模式

# addHeight
source: Enter your height
et: Sisesta oma pikkus

# faq_q4
source: Can I enter a target weight below 50kg / 110 lb / 7.9 st?
et: Kas ma saan sisestada oma kaalueesmärgi, mis jääb alla 50 kg / 110 lb / 7.9 st?

# faq_a4
source: Yes, by providing your height. Anorexia is a serious disease that is increasingly becoming a problem for society as a whole, partly due to the many negative examples on social media. To support prevention efforts, we do not allow target weights below 50 kg / 110 lb / 7.9 st. Entering your height allows us to calculate a minimum target weight corresponding to a BMI of 18.5.
et: Jah, kui lisad oma pikkuse. Anoreksia on tõsine haigus, mis vaevab meie ühiskondi tervikuna ning on mõjutatud sotsiaalmeedias leiduvatest valedest näidetest. Toetamaks ennetustööd, ei luba me sisestada kaalueesmärke, mis jäävad alla 50 kg / 110 lb / 7.9 st. Sinu pikkuse sisestamine võimaldab arvutada väikesi kaalueesmärke, mis vastavad kehamassiindeksile 18,5.

source: High contrast
et: Väga kontrastne

source: BMI
et: KMI/BMI

source: scheme variant
et: Värvikombinatsiooni variant
