// ignore: unused_import
import 'package:intl/intl.dart' as intl;
import 'app_localizations.dart';

// ignore_for_file: type=lint

/// The translations for Tamil (`ta`).
class AppLocalizationsTa extends AppLocalizations {
  AppLocalizationsTa([String locale = 'ta']) : super(locale);

  @override
  String get achievements => 'சாதனைகள்';

  @override
  String get experimentalFeatures => 'சோதனை நற்பொருத்தங்கள்';

  @override
  String get looseWeight => 'எடை குறைக்க';

  @override
  String get gainWeight => 'எடை அதிகரிக்க';

  @override
  String get tapDateAboveToAddEntry => 'Tap a date above to add an entry.';

  @override
  String get looseWeightSubtitle =>
      'எடை குறைப்பதற்கோ அல்லது எடை அதிகரிப்பதற்கோ இடையில் மாறுதல்.';

  @override
  String get days => 'நாட்கள்';

  @override
  String get weeks => 'வாரங்கள்';

  @override
  String get week => 'வாரம்';

  @override
  String get months => 'திங்கள்கள்';

  @override
  String get month => 'திங்கள்';

  @override
  String get years => 'ஆண்டுகள்';

  @override
  String get year => 'ஆண்டு';

  @override
  String get never => 'ஒருபோதும்இல்லை';

  @override
  String get weekly => 'வாராந்திர';

  @override
  String get biweekly => 'இரு வாரங்கள்';

  @override
  String get monthly => 'திங்கள்தோறும்';

  @override
  String get quarterly => 'காலாண்டு';

  @override
  String get backupReminder => 'தவறாமல் காப்புப் பிரதி எடுக்கவும்';

  @override
  String get backupReminderButton => 'காப்புப் பிரதி';

  @override
  String get backupSuccess =>
      'காப்புப்பிரதி வெற்றிகரமாக ஏற்றுமதி செய்யப்பட்டது';

  @override
  String get backupInterval => 'இடைவேளை';

  @override
  String get lastBackup => 'கடைசி காப்புப்பிரதி';

  @override
  String get nextBackup => 'அடுத்த காப்புப்பிரதி';

  @override
  String get stats => 'புள்ளிவிவரங்கள்';

  @override
  String get trale => 'பாதை';

  @override
  String get unit => 'அலகுகள்';

  @override
  String get date => 'திகதி';

  @override
  String get weight => 'எடை';

  @override
  String get user => 'பயனர் தன்விவரம்';

  @override
  String get userSettings => 'பயனர் அமைப்புகள்';

  @override
  String get dangerzone => 'இடர் மண்டலம்';

  @override
  String get settings => 'அமைப்புகள்';

  @override
  String get faq => 'கேள்விகள்';

  @override
  String get about => 'பற்றி';

  @override
  String get defaultLang => 'கணினி இயல்புநிலை';

  @override
  String get language => 'மொழி';

  @override
  String get theme => 'கருப்பொருள்';

  @override
  String get darkmode => 'இருண்ட';

  @override
  String get lightmode => 'ஒளி';

  @override
  String get systemmode => 'கணினி';

  @override
  String get export => 'அனைத்து அளவீடுகளையும் ஏற்றுமதி செய்';

  @override
  String get exportSubtitle =>
      'இது அனைத்து அளவீடுகளையும் அனைத்து பயன்பாடுகளுக்கும் காட்டுகிறது.';

  @override
  String get exportDialog =>
      'இது அனைத்து அளவீடுகளையும் வெளிப்புற சேமிப்பகத்திற்கு ஏற்றுமதி செய்யும். எழுதும் இசைவுகள் தேவை.';

  @override
  String get open => 'திற';

  @override
  String get abort => 'நீக்கறல்';

  @override
  String get import => 'காப்புப்பிரதி இறக்குமதி செய்';

  @override
  String get importSubtitle =>
      '.txt காப்பு கோப்பிலிருந்து அளவீடுகளை இறக்குமதி செய்.';

  @override
  String get amoled => 'கருப்பு';

  @override
  String get amoledSubtitle =>
      'இருண்ட பயன்முறைக்கு பின்னணி நிறத்தை உண்மையான கருப்பு என மாற்றவும்.';

  @override
  String get reset => 'பயன்பாட்டை மீட்டமை';

  @override
  String get factoryReset => 'தொழிற்சாலை மீட்டமைப்பு';

  @override
  String get factoryResetSubtitle =>
      'எல்லா அமைப்புகளையும் மீட்டமைத்து அனைத்து அளவீடுகளையும் நீக்கவும்.';

  @override
  String get factoryResetDialog =>
      'பயன்பாட்டை இயல்புநிலைக்கு மீட்டமைக்கவா? இது அனைத்து அமைப்புகளையும் நீக்குகிறது, மேலும் கூடுதல் அளவீடுகள். இதைச் செயல்தவிர்க்க முடியாது.';

  @override
  String get delete => 'நீக்கு';

  @override
  String get importingAbort => 'இறக்குமதி கைவிடப்பட்டது.';

  @override
  String get importDialog =>
      'தற்போதைய தரவுத்தளத்தில் அனைத்து அளவீடுகளையும் சேர்க்கவும். இதைச் செயல்தவிர்க்க முடியாது!';

  @override
  String get home => 'வீடு';

  @override
  String get yes => 'ஆம்';

  @override
  String get ok => 'சரி';

  @override
  String get save => 'சேமி';

  @override
  String get edit => 'தொகு';

  @override
  String get backup => 'காப்புப்பிரதி';

  @override
  String get time => 'நேரம்';

  @override
  String get assets => 'சொத்துக்கள்';

  @override
  String get packages => 'தொகுப்பு';

  @override
  String get loading => 'ஏற்றுகிறது';

  @override
  String get measurements => 'அளவீடுகள்';

  @override
  String get version => 'பதிப்பு';

  @override
  String get tpl => 'மூன்றாம் தரப்பு உரிமங்கள்';

  @override
  String get licence => 'உரிமம்';

  @override
  String get sourcecode => 'மூலக் குறியீடு';

  @override
  String get openIssue => 'திறந்த சிக்கல்';

  @override
  String undertpl(String years, String author, String licence) {
    return '© $years $author ஆல் $licence உரிமத்தின் கீழ்';
  }

  @override
  String get addWeight => 'உங்கள் எடையை உள்ளிடவும்';

  @override
  String get addHeight => 'உங்கள் உயரத்தை உள்ளிடவும்';

  @override
  String get interpolation => 'இடைக்கணிப்பு';

  @override
  String get strength => 'வலிமை';

  @override
  String get none => 'எதுவுமில்லை';

  @override
  String get soft => 'மென்மை';

  @override
  String get medium => 'நடு';

  @override
  String get strong => 'வலுவான';

  @override
  String get welcome => 'வரவேற்கிறோம்';

  @override
  String get onBoarding1 =>
      'இந்த எளிமையான பொருள்-நீங்கள்-வடிவமைப்பு பயன்பாடு உங்கள் கனவு எடையை அடைய உதவுகிறது! நீங்கள் உடல் எடையை அதிகரிக்க விரும்புகிறீர்களோ, எடை குறைக்க அல்லது உங்கள் எடையைப் பராமரிக்க விரும்புகிறீர்களோ: நம்பகமான எடை கணிப்புகள் மற்றும் பல்துறை புள்ளிவிவரங்கள் பாதையில் இருக்க உதவுகின்றன.\n\n உங்களை நீங்களே கண்டுபிடிக்க இன்று எங்கள் சமூகத்தில் சேருங்கள்.\n 🐺🤸‍♀️🏋‍♀️🧘‍♂️🏆🥇';

  @override
  String get onBoarding2 =>
      'உங்கள் பயன்பாட்டைத் தனிப்பயனாக்க ஆறு கருப்பொருள்களில் ஒன்றைத் தேர்வுசெய்க. உங்கள் உணர்வுகளை எது சிறந்தது?';

  @override
  String get onBoarding3 =>
      'எங்கள் பயன்பாட்டை முயற்சித்ததற்கு நன்றி.🙂\n\n நீங்கள் பயன்பாட்டை விரும்பினால், உங்கள் கருத்து, அறிவிலிமையம் மீதான பங்களிப்பு அல்லது ஒரு காபி குறித்து நாங்கள் மிகவும் மகிழ்ச்சியடைவோம். பதிலுக்கு, எரிச்சலூட்டும் மற்றும் தனியுரிமை-விமர்சன விளம்பரங்களை நாங்கள் உங்களுக்கு விட்டுவிடுகிறோம்.';

  @override
  String get onBoarding2Title => 'பாணி';

  @override
  String get onBoarding3Title => 'தனியுரிமை';

  @override
  String get skip => 'தவிர்';

  @override
  String get startApp => 'தொடங்கு';

  @override
  String get targetWeight => 'இலக்கு எடை';

  @override
  String get targetWeightMotivation =>
      'இலக்கு எடையை அமைப்பது மிகவும் முக்கியமானது மற்றும் சரியான திசையில் ஒரு படி. மனதில் ஒரு குறிக்கோளைக் கொண்டிருப்பது அதை அடைய மேலும் செய்ய உங்களைத் தூண்டுகிறது.';

  @override
  String get targetWeightShort => 'இலக்கு';

  @override
  String get addUserName => 'நாங்கள் உங்களை எப்படி அழைப்பது?';

  @override
  String get addTargetWeight => 'இலக்கு எடை சேர்';

  @override
  String get intro1 => 'அழுத்து';

  @override
  String get intro2 => 'தொடங்க';

  @override
  String get intro3 => 'உங்கள் முதல் அளவீட்டுடன் தொடங்க இன்று ஒரு நல்ல நாள்!';

  @override
  String get faqtext =>
      'அடிக்கடி நிகழும் சில கேள்விகளுக்கான பதில்களை இங்கே காணலாம். உங்களிடம் வேறு ஏதேனும் கேள்விகள் இருந்தால், அறிவிலிமையம் களஞ்சியத்தில் ஒரு சிக்கலைத் திறக்கத் தயங்க வேண்டாம்.';

  @override
  String get faq_q1 =>
      'நற்பண்பு/செயல்பாடு ஔ இல்லை. இது எப்போது செயல்படுத்தப்படும்?';

  @override
  String get faq_a1 =>
      'பயன்பாடு எங்கள் இலவச நேரத்தில் பராமரிக்கப்படுகிறது, மேலும் பயன்பாட்டை நேர்த்தியாகவும் எளிமையாகவும் வைத்திருக்க முயற்சிக்கிறோம். பயன்பாட்டைக் குறைவாகப் பயன்படுத்தக்கூடியதாக மாற்றும் பல நற்பண்புகளைச் சேர்ப்பது என்று நாங்கள் நம்புகிறோம். ஒரு முக்கிய நற்பண்பை எங்களிடம் காணவில்லை என்று நீங்கள் நம்பினால், ஒரு சிக்கலையோ அல்லது ஒன்றிணைக்கும் கோரிக்கையையோ திறக்கத் தயங்க வேண்டாம்.';

  @override
  String get faq_q2 => 'அறிமுகம்/துவக்க திரையை மீண்டும் பார்க்க முடியுமா?';

  @override
  String get faq_a2 => 'ஆம் நிச்சயமாக! கீழே உள்ள சின்னத்தை அழுத்தவும்.';

  @override
  String get faq_a2_widget => 'துவக்க திரைக்குத் திரும்புக';

  @override
  String get faq_q3 => 'பயன்பாட்டு படவுரு என்ன காட்டுகிறது?';

  @override
  String get faq_a3 =>
      'ஒரு அலறல் ஓநாய் உட்கார்ந்து, அதன் வால் ஓரளவு \'டி\' என்ற எழுத்துக்களால் மறைக்கப்பட்டுள்ளது, மற்றும் \'ஆர்\' என்ற எழுத்து.';

  @override
  String get faq_q4 =>
      '50 கிலோ / 110 பவுண்டு / 7.9 எச்டி எடைக்குக் குறைவான இலக்கு எடையை நான் உள்ளிடலாமா?';

  @override
  String get faq_a4 =>
      'ஆம், உங்கள் உயரத்தை வழங்குவதன் மூலம்.\n\nஅனோரெக்ஸியா என்பது ஒரு தீவிர நோயாகும், இது ஒட்டுமொத்த சமூகத்திற்கும் ஒரு பிரச்சனையாக மாறி வருகிறது, இதற்குச் சமூக ஊடகங்களில் உள்ள பல எதிர்மறை உதாரணங்கள் ஒரு காரணம். தடுப்பு முயற்சிகளை ஆதரிக்க, 50 கிலோ / 110 பவுண்டு / 7.9 எச்டிகளுக்குக் குறைவான இலக்கு எடைகளை நாங்கள் அனுமதிப்பதில்லை. உங்கள் உயரத்தை உள்ளிடுவது 18.5 பிஎம்ஐக்கு ஒத்த குறைந்தபட்ச இலக்கு எடையைக் கணக்கிட இசைகிறது.';

  @override
  String get target_weight_warning =>
      'அனோரெக்ஸியா என்பது ஒரு தீவிர நோயாகும், இது ஒட்டுமொத்த சமூகத்திற்கும் அதிகரித்து வரும் ஒரு பிரச்சனையாக மாறி வருகிறது, இதற்குச் சமூக ஊடகங்களில் உள்ள பல எதிர்மறை உதாரணங்கள் ஓரளவு காரணமாகும். தடுப்பு முயற்சிகளை ஆதரிக்க, 50 கிலோ / 110 பவுண்டு / 7.9 எச்டிகளுக்குக் குறைவான இலக்கு எடைகள் மற்றும் 18.5 க்குக் குறைவான பிஎம்ஐ ஆகியவற்றை நாங்கள் அனுமதிப்பதில்லை.';

  @override
  String get max => 'மிகையளவு';

  @override
  String get min => 'குறையளவு';

  @override
  String get change => 'மாற்றம்';

  @override
  String get totalChange => 'மொத்த மாற்றம்';

  @override
  String get schemeVariant => 'திட்ட மாறுபாடு';

  @override
  String get mean => 'சராசரி';

  @override
  String get measurementFrequency => 'அளவீட்டு அதிர்வெண்';

  @override
  String get targetWeightReached => 'உங்கள் இலக்கு எடையை அடைந்தீர்கள்!';

  @override
  String get targetWeightReachedIn => 'இலக்கு எடையை அடைய மீதம்';

  @override
  String get maxStreak => 'மிக நீளமான கீற்று';

  @override
  String get currentStreak => 'தற்போதைய கீற்று';

  @override
  String get timeSinceFirstMeasurement => 'முதல் அளவீட்டிலிருந்து நேரம்';

  @override
  String get firstDay => 'முதல் நாள்';

  @override
  String get highContrast => 'அதிக மாறுபாடு';

  @override
  String get bmi => 'உஎகு';
}
